zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_jh/pic32cm_jh01/atdf/PIC32CM1216JH01048.atdf
            <register-group name="OTP4_FUSES" name-in-module="OTP4_FUSES" address-space="fuses" offset="0x00806018"/>
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="2.2.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for OSC32KCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="2.2.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_FDPLL" value="0" caption="Index of Generic Clock for DPLL"/>
              <param name="GCLK_ID_FDPLL32K" value="1" caption="Index of Generic Clock for DPLL 32K"/>
              <param name="FDPLL_VERSION" value="0x220"/>
              <param name="OSC48M_VERSION" value="0x101"/>
              <param name="XOSC_VERSION" value="0x210"/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for OSCCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="4" caption="Number of bridges AHB/APB"/>
              <param name="INTFLAG_NUM" value="4" caption="Number of intflag registers"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="2.1.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1" caption="one if RAM HS can be back biased"/>
              <param name="PD_NUM" value="0" caption="Number of switchable Power Domain"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="3.1.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41000000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
            </signals>
            <parameters>
              <param name="BITS" value="56"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported?"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="2"/>
              <param name="MSB" value="55"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported?"/>
              <param name="INSTANCE_ID" value="32" caption="Instance index for PORT"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="2.0.2">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="EXTWAKE" index="0" function="A" pad="PA00"/>
              <signal group="EXTWAKE" index="1" function="A" pad="PA01"/>
              <signal group="EXTWAKE" index="2" function="A" pad="PA02"/>
              <signal group="EXTWAKE" index="3" function="A" pad="PA03"/>
              <signal group="EXTWAKE" index="4" function="A" pad="PA04"/>
              <signal group="EXTWAKE" index="5" function="A" pad="PA05"/>
              <signal group="EXTWAKE" index="6" function="A" pad="PA06"/>
              <signal group="EXTWAKE" index="7" function="A" pad="PA07"/>
              <signal group="EXTWAKE" index="8" function="A" pad="PA08"/>
              <signal group="EXTWAKE" index="9" function="A" pad="PA09"/>
              <signal group="EXTWAKE" index="10" function="A" pad="PA10"/>
              <signal group="EXTWAKE" index="11" function="A" pad="PA11"/>
              <signal group="EXTWAKE" index="12" function="A" pad="PA12"/>
              <signal group="EXTWAKE" index="13" function="A" pad="PA13"/>
              <signal group="EXTWAKE" index="14" function="A" pad="PA14"/>
              <signal group="EXTWAKE" index="15" function="A" pad="PA15"/>
            </signals>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="0"/>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for RSTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" version="3a1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="62" caption="DMA RTC timestamp trigger"/>
              <param name="GPR_NUM" value="2" caption="Number of General-Purpose Registers"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="1" caption="Number of Tamper Inputs"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for RTC"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="3.1.1">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="2" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="3" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="18"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="65" caption="Instance index for SERCOM0"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="5" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="19"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="66" caption="Instance index for SERCOM1"/>
            </parameters>
          </instance>
