zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_jh/pic32cm_jh01/atdf/PIC32CM1216JH01048.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42004000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_MC_0" value="40" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="41" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="39" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="32" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="80" caption="Instance index for TC4"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8" caption="Instance index for WDT"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="Supervisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable Service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="3" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="4" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="NVMCTRL" index="6" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="DMAC" index="7" module-instance="DMAC" caption="Direct Memory Access Controller"/>
        <interrupt name="EVSYS" index="8" module-instance="EVSYS" caption="Event Systems"/>
        <interrupt name="SERCOM0" index="9" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="10" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2" index="11" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="12" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="CAN0" index="15" module-instance="CAN0" caption="Control Area Network 0"/>
        <interrupt name="TC0" index="20" module-instance="TC0" caption="Timer/Counter 0"/>
        <interrupt name="TC1" index="21" module-instance="TC1" caption="Timer/Counter 1"/>
        <interrupt name="TC2" index="22" module-instance="TC2" caption="Timer/Counter 2"/>
        <interrupt name="TC3" index="23" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="24" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="ADC0" index="25" module-instance="ADC0" caption="Analog-to-Digital Converter 0"/>
        <interrupt name="AC" index="27" module-instance="AC" caption="Analog Comparators"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_PERD" index="1" module-instance="RTC"/>
          <generator name="OSCCTRL_XOSC_FAIL" index="3" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="4" module-instance="OSC32KCTRL"/>
          <generator name="RTC_CMP_0" index="5" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="6" module-instance="RTC"/>
          <generator name="RTC_OVF" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="13" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="14" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="15" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="30" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="31" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="32" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="33" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="34" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="35" module-instance="DMAC"/>
          <generator name="TC0_OVF" index="53" module-instance="TC0"/>
          <generator name="TC0_MC_0" index="54" module-instance="TC0"/>
          <generator name="TC0_MC_1" index="55" module-instance="TC0"/>
          <generator name="TC1_OVF" index="56" module-instance="TC1"/>
          <generator name="TC1_MC_0" index="57" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="58" module-instance="TC1"/>
          <generator name="TC2_OVF" index="59" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="60" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="61" module-instance="TC2"/>
          <generator name="TC3_OVF" index="62" module-instance="TC3"/>
          <generator name="TC3_MC_0" index="63" module-instance="TC3"/>
          <generator name="TC3_MC_1" index="64" module-instance="TC3"/>
          <generator name="TC4_OVF" index="65" module-instance="TC4"/>
          <generator name="TC4_MC_0" index="66" module-instance="TC4"/>
          <generator name="TC4_MC_1" index="67" module-instance="TC4"/>
          <generator name="ADC0_RESRDY" index="68" module-instance="ADC0"/>
          <generator name="ADC0_WINMON" index="69" module-instance="ADC0"/>
          <generator name="AC_COMP_0" index="72" module-instance="AC"/>
          <generator name="AC_COMP_1" index="73" module-instance="AC"/>
          <generator name="AC_WIN_0" index="76" module-instance="AC"/>
          <generator name="PAC_ACCERR" index="85" module-instance="PAC"/>
        </generators>
        <users>
          <user name="PORT_EV_0" index="1" module-instance="PORT"/>
          <user name="PORT_EV_1" index="2" module-instance="PORT"/>
          <user name="PORT_EV_2" index="3" module-instance="PORT"/>
          <user name="PORT_EV_3" index="4" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="8" module-instance="DMAC"/>
          <user name="TC0_EVU" index="23" module-instance="TC0"/>
          <user name="TC1_EVU" index="24" module-instance="TC1"/>
          <user name="TC2_EVU" index="25" module-instance="TC2"/>
          <user name="TC3_EVU" index="26" module-instance="TC3"/>
          <user name="TC4_EVU" index="27" module-instance="TC4"/>
          <user name="ADC0_START" index="28" module-instance="ADC0"/>
          <user name="ADC0_SYNC" index="29" module-instance="ADC0"/>
          <user name="AC_SOC_0" index="32" module-instance="AC"/>
          <user name="AC_SOC_1" index="33" module-instance="AC"/>
          <user name="MTB_START" index="43" module-instance="MTB"/>
          <user name="MTB_STOP" index="44" module-instance="MTB"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x1106100A"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
